In [1]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
import statsmodels.api as sm
import statsmodels.formula.api as smf
import statsmodels.graphics.api as smg
from scipy import stats

In [2]:
t = np.matrix([[73,21,16,11],[45,36,24,9]])

In [3]:
q = stats.chi2_contingency(t)
q

Chi2ContingencyResult(statistic=12.193744836893364, pvalue=0.006748100370291122, dof=3, expected_freq=array([[60.75744681, 29.34893617, 20.59574468, 10.29787234],
       [57.24255319, 27.65106383, 19.40425532,  9.70212766]]))

In [4]:
np.sqrt((12.19/235))  #cramers coeficient

0.2277550008793043

In [5]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [6]:
tab = pd.crosstab(df['class'],df['survived'])
tab

survived    0    1
class
First      80  136
Second     97   87
Third     372  119

In [10]:
tab.sum()

survived
0    549
1    342
dtype: int64

In [7]:
o = stats.chi2_contingency(tab)
o

Chi2ContingencyResult(statistic=102.88898875696056, pvalue=4.549251711298793e-23, dof=2, expected_freq=array([[133.09090909,  82.90909091],
       [113.37373737,  70.62626263],
       [302.53535354, 188.46464646]]))

In [8]:
u = np.sqrt(102.88/(549+342))
u

0.33980254383848

In [9]:
c= np.sqrt((102.88/(102.88+549+342)))
c

0.3217351436137077